ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_UART.cpp
// Copyright Microsoft Corporation
// Copyright Oberon microsystems, Inc
// Copyright GHI Electronics, LLC
//
// Licensed under the Apache License, Version 2.0 (the "License");
// You may obtain a copy of the License at
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <algorithm>
#include "STM32F4.h"

// StopBits
#define USART_STOP_BITS_NONE          0
#define USART_STOP_BITS_ONE           1
#define USART_STOP_BITS_TWO           2
#define USART_STOP_BITS_ONEPOINTFIVE  3

//Bit data length
#define STM32F4_UART_DATA_BIT_LENGTH_8    8
#define STM32F4_UART_DATA_BIT_LENGTH_9    9

bool STM32F4_Uart_TxHandshakeEnabledState(int portNum);
void STM32F4_Uart_TxBufferEmptyInterruptEnable(int portNum, bool enable);
void STM32F4_Uart_RxBufferFullInterruptEnable(int portNum, bool enable);
void STM32F4_Uart_Reset();

typedef  USART_TypeDef* USART_TypeDef_Ptr;

struct UartController {
    uint8_t                             *TxBuffer;
    uint8_t                             *RxBuffer;

    size_t                              txBufferCount;
    size_t                              txBufferIn;
    size_t                              txBufferOut;
    size_t                              txBufferSize;

    size_t                              rxBufferCount;
    size_t                              rxBufferIn;
    size_t                              rxBufferOut;
    size_t                              rxBufferSize;

    USART_TypeDef_Ptr                   portPtr;

    bool                                isOpened;
    bool                                handshaking;

    TinyCLR_Uart_ErrorReceivedHandler   errorEventHandler;
    TinyCLR_Uart_DataReceivedHandler    dataReceivedEventHandler;

    const TinyCLR_Uart_Provider*        provider;

};

static const STM32F4_Gpio_Pin g_STM32F4_Uart_Tx_Pins[] = STM32F4_UART_TX_PINS;
static const STM32F4_Gpio_Pin g_STM32F4_Uart_Rx_Pins[] = STM32F4_UART_RX_PINS;
static const STM32F4_Gpio_Pin g_STM32F4_Uart_Cts_Pins[] = STM32F4_UART_CTS_PINS;
static const STM32F4_Gpio_Pin g_STM32F4_Uart_Rts_Pins[] = STM32F4_UART_RTS_PINS;
static const uint32_t g_STM32F4_Uart_RxDefaultBuffersSize[] = STM32F4_UART_DEFAULT_RX_BUFFER_SIZE;
static const uint32_t g_STM32F4_Uart_TxDefaultBuffersSize[] = STM32F4_UART_DEFAULT_TX_BUFFER_SIZE;

static const int TOTAL_UART_CONTROLLERS = SIZEOF_ARRAY(g_STM32F4_Uart_Tx_Pins);

static UartController g_UartController[TOTAL_UART_CONTROLLERS];

static USART_TypeDef_Ptr g_STM32F4_Uart_Ports[TOTAL_UART_CONTROLLERS];

static uint8_t uartProviderDefs[TOTAL_UART_CONTROLLERS * sizeof(TinyCLR_Uart_Provider)];
static TinyCLR_Uart_Provider* uartProviders[TOTAL_UART_CONTROLLERS];
static TinyCLR_Api_Info uartApi;

const TinyCLR_Api_Info* STM32F4_Uart_GetApi() {
    for (int i = 0; i < TOTAL_UART_CONTROLLERS; i++) {
        uartProviders[i] = (TinyCLR_Uart_Provider*)(uartProviderDefs + (i * sizeof(TinyCLR_Uart_Provider)));
        uartProviders[i]->Parent = &uartApi;
        uartProviders[i]->Index = i;
        uartProviders[i]->Acquire = &STM32F4_Uart_Acquire;
        uartProviders[i]->Release = &STM32F4_Uart_Release;
        uartProviders[i]->SetActiveSettings = &STM32F4_Uart_SetActiveSettings;
        uartProviders[i]->Flush = &STM32F4_Uart_Flush;
        uartProviders[i]->Read = &STM32F4_Uart_Read;
        uartProviders[i]->Write = &STM32F4_Uart_Write;
        uartProviders[i]->SetPinChangedHandler = &STM32F4_Uart_SetPinChangedHandler;
        uartProviders[i]->SetErrorReceivedHandler = &STM32F4_Uart_SetErrorReceivedHandler;
        uartProviders[i]->SetDataReceivedHandler = &STM32F4_Uart_SetDataReceivedHandler;
        uartProviders[i]->GetBreakSignalState = &STM32F4_Uart_GetBreakSignalState;
        uartProviders[i]->SetBreakSignalState = &STM32F4_Uart_SetBreakSignalState;
        uartProviders[i]->GetCarrierDetectState = &STM32F4_Uart_GetCarrierDetectState;
        uartProviders[i]->GetClearToSendState = &STM32F4_Uart_GetClearToSendState;
        uartProviders[i]->GetDataReadyState = &STM32F4_Uart_GetDataReadyState;
        uartProviders[i]->GetIsDataTerminalReadyEnabled = &STM32F4_Uart_GetIsDataTerminalReadyEnabled;
        uartProviders[i]->SetIsDataTerminalReadyEnabled = &STM32F4_Uart_SetIsDataTerminalReadyEnabled;
        uartProviders[i]->GetIsRequestToSendEnabled = &STM32F4_Uart_GetIsRequestToSendEnabled;
        uartProviders[i]->SetIsRequestToSendEnabled = &STM32F4_Uart_SetIsRequestToSendEnabled;
        uartProviders[i]->GetReadBufferSize = &STM32F4_Uart_GetReadBufferSize;
        uartProviders[i]->SetReadBufferSize = &STM32F4_Uart_SetReadBufferSize;
        uartProviders[i]->GetWriteBufferSize = &STM32F4_Uart_GetWriteBufferSize;
        uartProviders[i]->SetWriteBufferSize = &STM32F4_Uart_SetWriteBufferSize;
        uartProviders[i]->GetUnreadCount = &STM32F4_Uart_GetUnreadCount;
        uartProviders[i]->GetUnwrittenCount = &STM32F4_Uart_GetUnwrittenCount;
        uartProviders[i]->ClearReadBuffer = &STM32F4_Uart_ClearReadBuffer;
        uartProviders[i]->ClearWriteBuffer = &STM32F4_Uart_ClearWriteBuffer;
    }

    uartApi.Author = "GHI Electronics, LLC";
    uartApi.Name = "GHIElectronics.TinyCLR.NativeApis.STM32F4.UartProvider";
    uartApi.Type = TinyCLR_Api_Type::UartProvider;
    uartApi.Version = 0;
    uartApi.Count = TOTAL_UART_CONTROLLERS;
    uartApi.Implementation = uartProviders;

    if (TOTAL_UART_CONTROLLERS > 0) g_STM32F4_Uart_Ports[0] = USART1;
    if (TOTAL_UART_CONTROLLERS > 1) g_STM32F4_Uart_Ports[1] = USART2;
#if !defined(STM32F401xE) && !defined(STM32F411xE)
    if (TOTAL_UART_CONTROLLERS > 2) g_STM32F4_Uart_Ports[2] = USART3;
    if (TOTAL_UART_CONTROLLERS > 3) g_STM32F4_Uart_Ports[3] = UART4;
    if (TOTAL_UART_CONTROLLERS > 4) g_STM32F4_Uart_Ports[4] = UART5;
    if (TOTAL_UART_CONTROLLERS > 5) g_STM32F4_Uart_Ports[5] = USART6;
#ifdef UART7
    if (TOTAL_UART_CONTROLLERS > 6) g_STM32F4_Uart_Ports[6] = UART7;
#ifdef UART8
    if (TOTAL_UART_CONTROLLERS > 7) g_STM32F4_Uart_Ports[7] = UART8;
#ifdef UART9
    if (TOTAL_UART_CONTROLLERS > 8) g_STM32F4_Uart_Ports[8] = UART9;
#endif
#endif
#endif
#endif
    return &uartApi;
}

TinyCLR_Result STM32F4_Uart_GetReadBufferSize(const TinyCLR_Uart_Provider* self, size_t& size) {
    size = g_UartController[self->Index].rxBufferSize == 0 ? g_STM32F4_Uart_RxDefaultBuffersSize[self->Index] : g_UartController[self->Index].rxBufferSize;

