ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_UART.cpp
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Uart_SetReadBufferSize(const TinyCLR_Uart_Provider* self, size_t size) {
    auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

    if (size <= 0)
        return TinyCLR_Result::ArgumentInvalid;

    if (g_UartController[self->Index].rxBufferSize) {
        memoryProvider->Free(memoryProvider, g_UartController[self->Index].RxBuffer);
    }

    g_UartController[self->Index].rxBufferSize = size;

    g_UartController[self->Index].RxBuffer = (uint8_t*)memoryProvider->Allocate(memoryProvider, size);

    if (g_UartController[self->Index].RxBuffer == nullptr) {
        g_UartController[self->Index].rxBufferSize = 0;

        return TinyCLR_Result::OutOfMemory;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Uart_GetWriteBufferSize(const TinyCLR_Uart_Provider* self, size_t& size) {
    size = g_UartController[self->Index].txBufferSize == 0 ? g_STM32F4_Uart_TxDefaultBuffersSize[self->Index] : g_UartController[self->Index].txBufferSize;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Uart_SetWriteBufferSize(const TinyCLR_Uart_Provider* self, size_t size) {
    auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

    if (size <= 0)
        return TinyCLR_Result::ArgumentInvalid;

    if (g_UartController[self->Index].txBufferSize) {
        memoryProvider->Free(memoryProvider, g_UartController[self->Index].TxBuffer);
    }

    g_UartController[self->Index].txBufferSize = size;

    g_UartController[self->Index].TxBuffer = (uint8_t*)memoryProvider->Allocate(memoryProvider, size);

    if (g_UartController[self->Index].TxBuffer == nullptr) {
        g_UartController[self->Index].txBufferSize = 0;

        return TinyCLR_Result::OutOfMemory;
    }

    return TinyCLR_Result::Success;
}

void STM32F4_Uart_IrqRx(int portNum, uint16_t sr) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    uint8_t data = (uint8_t)(g_UartController[portNum].portPtr->DR); // read RX data

    if (g_UartController[portNum].rxBufferCount == g_UartController[portNum].rxBufferSize) {
        if (g_UartController[portNum].errorEventHandler != nullptr)
            g_UartController[portNum].errorEventHandler(g_UartController[portNum].provider, TinyCLR_Uart_Error::ReceiveFull);

        return;
    }

    g_UartController[portNum].RxBuffer[g_UartController[portNum].rxBufferIn++] = data;

    g_UartController[portNum].rxBufferCount++;

    if (g_UartController[portNum].rxBufferIn == g_UartController[portNum].rxBufferSize)
        g_UartController[portNum].rxBufferIn = 0;

    if (g_UartController[portNum].dataReceivedEventHandler != nullptr)
        g_UartController[portNum].dataReceivedEventHandler(g_UartController[portNum].provider, 1);

    if (g_UartController[portNum].errorEventHandler != nullptr) {
        if (sr & USART_SR_ORE)
            g_UartController[portNum].errorEventHandler(g_UartController[portNum].provider, TinyCLR_Uart_Error::BufferOverrun);

        if (sr & USART_SR_FE)
            g_UartController[portNum].errorEventHandler(g_UartController[portNum].provider, TinyCLR_Uart_Error::Frame);

        if (sr & USART_SR_PE)
            g_UartController[portNum].errorEventHandler(g_UartController[portNum].provider, TinyCLR_Uart_Error::ReceiveParity);
    }
}

void STM32F4_Uart_IrqTx(int portNum) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    if (STM32F4_Uart_TxHandshakeEnabledState(portNum)) {
        if (g_UartController[portNum].txBufferCount > 0) {
            uint8_t data = g_UartController[portNum].TxBuffer[g_UartController[portNum].txBufferOut++];

            g_UartController[portNum].txBufferCount--;

            if (g_UartController[portNum].txBufferOut == g_UartController[portNum].txBufferSize)
                g_UartController[portNum].txBufferOut = 0;

            g_UartController[portNum].portPtr->DR = data; // write TX data

        }
        else {
            STM32F4_Uart_TxBufferEmptyInterruptEnable(portNum, false); // Disable interrupt when no more data to send.
        }
    }
}

void STM32F4_Uart_InterruptHandler(int8_t portNum, uint16_t sr) {
    if (sr & USART_SR_RXNE)
        STM32F4_Uart_IrqRx(portNum, sr);

    if (sr & USART_SR_TXE)
        STM32F4_Uart_IrqTx(portNum);
}

void STM32F4_Uart_Interrupt0(void* param) {
    uint16_t sr = USART1->SR;

    STM32F4_Uart_InterruptHandler(0, sr);
}

void STM32F4_Uart_Interrupt1(void* param) {
    uint16_t sr = USART2->SR;

    STM32F4_Uart_InterruptHandler(1, sr);
}

#if !defined(STM32F401xE) && !defined(STM32F411xE)
void STM32F4_Uart_Interrupt2(void* param) {
    uint16_t sr = USART3->SR;

    STM32F4_Uart_InterruptHandler(2, sr);
}

void STM32F4_Uart_Interrupt3(void* param) {
    uint16_t sr = UART4->SR;

    STM32F4_Uart_InterruptHandler(3, sr);
}

void STM32F4_Uart_Interrupt4(void* param) {
    uint16_t sr = UART5->SR;

    STM32F4_Uart_InterruptHandler(4, sr);
}

void STM32F4_Uart_Interrupt5(void* param) {
    uint16_t sr = USART6->SR;

    STM32F4_Uart_InterruptHandler(5, sr);
}
#ifdef UART7
void STM32F4_Uart_Interrupt6(void* param) {
    uint16_t sr = UART7->SR;

    STM32F4_Uart_InterruptHandler(6, sr);
}
#ifdef UART8
void STM32F4_Uart_Interrupt7(void* param) {
    uint16_t sr = UART8->SR;

    STM32F4_Uart_InterruptHandler(7, sr);
}
#ifdef UART9
void STM32F4_Uart_Interrupt8(void* param) {
    uint16_t sr = UART9->SR;

    STM32F4_Uart_InterruptHandler(8, sr);
}
#endif
#endif
#endif
#endif

TinyCLR_Result STM32F4_Uart_Acquire(const TinyCLR_Uart_Provider* self) {
    int32_t portNum = self->Index;

    if (portNum >= TOTAL_UART_CONTROLLERS)
        return TinyCLR_Result::ArgumentInvalid;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (g_UartController[portNum].isOpened || !STM32F4_GpioInternal_OpenPin(g_STM32F4_Uart_Rx_Pins[portNum].number) || !STM32F4_GpioInternal_OpenPin(g_STM32F4_Uart_Tx_Pins[portNum].number))
        return TinyCLR_Result::SharingViolation;

    g_UartController[portNum].txBufferCount = 0;
    g_UartController[portNum].txBufferIn = 0;
    g_UartController[portNum].txBufferOut = 0;

    g_UartController[portNum].rxBufferCount = 0;
    g_UartController[portNum].rxBufferIn = 0;
    g_UartController[portNum].rxBufferOut = 0;

