ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_UART.cpp
    STM32F4_Uart_TxBufferEmptyInterruptEnable(portNum, true);
    STM32F4_Uart_RxBufferFullInterruptEnable(portNum, true);

    g_UartController[portNum].portPtr->CR1 |= USART_CR1_UE; // start uart

    return ((cts.number == PIN_NONE || rts.number == PIN_NONE) && handshaking == TinyCLR_Uart_Handshake::RequestToSend) ? TinyCLR_Result::NotSupported : TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Uart_Release(const TinyCLR_Uart_Provider* self) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    int32_t portNum = self->Index;

    g_UartController[portNum].portPtr->CR1 = 0; // stop uart

    switch (portNum) {
    case 0:
        STM32F4_InterruptInternal_Deactivate(USART1_IRQn);
        break;

    case 1:
        STM32F4_InterruptInternal_Deactivate(USART2_IRQn);
        break;
#if !defined(STM32F401xE) && !defined(STM32F411xE)
    case 2:
        STM32F4_InterruptInternal_Deactivate(USART3_IRQn);
        break;

    case 3:
        STM32F4_InterruptInternal_Deactivate(UART4_IRQn);
        break;

    case 4:
        STM32F4_InterruptInternal_Deactivate(UART5_IRQn);
        break;

    case 5:
        STM32F4_InterruptInternal_Deactivate(USART6_IRQn);
        break;

#ifdef UART7
    case 6:
        STM32F4_InterruptInternal_Deactivate(UART7_IRQn);
        break;

#ifdef UART8
    case 7:
        STM32F4_InterruptInternal_Deactivate(UART8_IRQn);
        break;

#ifdef UART9
    case 8:
        STM32F4_InterruptInternal_Deactivate(UART9_IRQn);
        break;
#endif
#endif
#endif
#endif
    }

    STM32F4_Uart_RxBufferFullInterruptEnable(portNum, false);
    STM32F4_Uart_TxBufferEmptyInterruptEnable(portNum, false);

    // disable UART clock
    if (portNum == 5) { // COM6 on APB2
        RCC->APB2ENR &= ~RCC_APB2ENR_USART6EN;
    }
    else if (portNum == 0) { // COM1 on APB2
        RCC->APB2ENR &= ~RCC_APB2ENR_USART1EN;
    }
    else if (portNum < 5) { // COM2-5 on APB1
        RCC->APB1ENR &= ~(RCC_APB1ENR_USART2EN >> 1 << portNum);
    }
#if !defined(STM32F401xE) && !defined(STM32F411xE)
#ifdef UART7
    else if (portNum == 6) {
        RCC->APB1ENR &= ~RCC_APB1ENR_UART7EN;
    }

#ifdef UART8
    else if (portNum == 7) {
        RCC->APB1ENR &= ~RCC_APB1ENR_UART8EN;
    }

#ifdef UART9
    else if (portNum == 8) {
        RCC->APB2ENR &= ~RCC_APB2ENR_UART9EN;
    }
#endif
#endif
#endif
#endif
    if (apiProvider != nullptr) {
        auto memoryProvider = (const TinyCLR_Memory_Provider*)apiProvider->FindDefault(apiProvider, TinyCLR_Api_Type::MemoryProvider);

        if (g_UartController[self->Index].txBufferSize != 0) {
            memoryProvider->Free(memoryProvider, g_UartController[self->Index].TxBuffer);

            g_UartController[self->Index].txBufferSize = 0;
        }

        if (g_UartController[self->Index].rxBufferSize != 0) {
            memoryProvider->Free(memoryProvider, g_UartController[self->Index].RxBuffer);

            g_UartController[self->Index].rxBufferSize = 0;
        }
    }

    if (g_UartController[portNum].isOpened) {
        STM32F4_GpioInternal_ClosePin(g_STM32F4_Uart_Rx_Pins[portNum].number);
        STM32F4_GpioInternal_ClosePin(g_STM32F4_Uart_Tx_Pins[portNum].number);

        if (g_UartController[portNum].handshaking) {
            STM32F4_GpioInternal_ClosePin(g_STM32F4_Uart_Cts_Pins[portNum].number);
            STM32F4_GpioInternal_ClosePin(g_STM32F4_Uart_Rts_Pins[portNum].number);
        }
    }

    g_UartController[portNum].isOpened = false;

    return TinyCLR_Result::Success;
}

void STM32F4_Uart_Reset() {
    for (auto i = 0; i < TOTAL_UART_CONTROLLERS; i++) {
        g_UartController[i].txBufferSize = 0;
        g_UartController[i].rxBufferSize = 0;

        STM32F4_Uart_Release(uartProviders[i]);

        g_UartController[i].isOpened = false;
    }
}

void STM32F4_Uart_TxBufferEmptyInterruptEnable(int portNum, bool enable) {
    if (enable) {
        g_UartController[portNum].portPtr->CR1 |= USART_CR1_TXEIE;  // tx int enable
    }
    else {
        g_UartController[portNum].portPtr->CR1 &= ~USART_CR1_TXEIE; // tx int disable
    }
}

void STM32F4_Uart_RxBufferFullInterruptEnable(int portNum, bool enable) {
    if (enable) {
        g_UartController[portNum].portPtr->CR1 |= USART_CR1_RXNEIE;  // rx int enable
    }
    else {
        g_UartController[portNum].portPtr->CR1 &= ~USART_CR1_RXNEIE; // rx int disable
    }
}

bool STM32F4_Uart_TxHandshakeEnabledState(int portNum) {
    // The state of the CTS input only matters if Flow Control is enabled
    if (g_UartController[portNum].portPtr->CR3 & USART_CR3_CTSE) {
        TinyCLR_Gpio_PinValue value;

        STM32F4_Gpio_Read(nullptr, g_STM32F4_Uart_Cts_Pins[portNum].number, value);

        return !(value == TinyCLR_Gpio_PinValue::High);
    }

    return true; // If this handshake input is not being used, it is assumed to be good
}

TinyCLR_Result STM32F4_Uart_Flush(const TinyCLR_Uart_Provider* self) {
    int32_t portNum = self->Index;

    if (g_UartController[portNum].isOpened) {
        while (g_UartController[portNum].txBufferCount > 0) {
            STM32F4_Time_Delay(nullptr, 1);
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Uart_Read(const TinyCLR_Uart_Provider* self, uint8_t* buffer, size_t& length) {
    int32_t portNum = self->Index;
    size_t i = 0;;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (g_UartController[portNum].isOpened == false) {
        return TinyCLR_Result::NotAvailable;
    }

    length = std::min(g_UartController[portNum].rxBufferCount, length);

    while (i < length) {
        buffer[i++] = g_UartController[portNum].RxBuffer[g_UartController[portNum].rxBufferOut];

        g_UartController[portNum].rxBufferOut++;

        g_UartController[portNum].rxBufferCount--;

        if (g_UartController[portNum].rxBufferOut == g_UartController[portNum].rxBufferSize)
            g_UartController[portNum].rxBufferOut = 0;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_Uart_Write(const TinyCLR_Uart_Provider* self, const uint8_t* buffer, size_t& length) {
    int32_t portNum = self->Index;
    int32_t i = 0;

